[
  {"date": "2025-08-05", "event": "GBC Secretariat, led by Major General Sin Sokha, met in Kuala Lumpur to strengthen ceasefire credibility ahead of August 7 meeting."},
  {"date": "2025-08-05", "event": "Thai forces used excavators and dug trenches in An Ses, prompting Cambodia to demand withdrawal, with discussions ongoing."},
  {"date": "2025-08-05", "event": "Thai-installed barbed wire in An Ses was removed by 5:30 PM after negotiations, though tensions persist."},
  {"date": "2025-08-04 11:00", "event": "Thai armed forces, with excavators, enter An Ses in Cambodian territory, laying barbed wire despite objections, violating July 28 ceasefire. Cambodia requests ICRC mediation for captured soldiers."},
  {"date": "2025-08-04 00:01", "event": "Cambodia reports calm at frontline but maintains high alertness, reaffirming commitment to July 28 ceasefire and urging reliance on official sources."},
  {"date": "2025-08-04", "event": "King Norodom Sihamoni authorizes Hun Sen to lead national defense coordination, granting full use of RCAF, including palace guards, akin to martial law."},
  {"date": "2025-08-04", "event": "Thai media reports Royal Thai Army spokesperson denies Cambodia’s claims of An Ses incursion, asserting Thailand’s commitment to ceasefire."},
  {"date": "2025-08-04", "event": "Thai forces entered An Ses with excavators and laid barbed wire, violating ceasefire, despite Cambodia’s sovereignty claims."},
  {"date": "2025-08-03 10:49", "event": "Cambodia reports Thai military plans to launch attacks from Ta Moan Thom, Ta Krabey, Preah Vihear, and An Ses, violating July 28 ceasefire. Thailand initially rejects Cambodia’s proposal for Malaysia, U.S., and China to observe GBC meeting."},
  {"date": "2025-08-03", "event": "Thailand’s Acting Minister of National Defense accepts Cambodia’s proposal for Malaysia, U.S., and China to observe GBC meeting, reversing earlier rejection."},
  {"date": "2025-08-03", "event": "ASEAN Military Observer Group, led by Malaysia’s Colonel Nazlee Bin Abdul Rahim, departed Phnom Penh to monitor ceasefire in Oddar Meanchey and Preah Vihear for two weeks."},
  {"date": "2025-08-03", "event": "Cambodia notified Thailand of ASEAN Observer Team’s visit to Oddar Meanchey and Preah Vihear from August 3 to monitor ceasefire implementation."},
  {"date": "2025-08-03", "event": "Cambodia reported Thai military plans to attack from Tamone Thom to Anseh, breaching July 28 ceasefire, prompting international appeals."},
  {"date": "2025-08-03", "event": "Cambodia-Thailand GBC Secretariat delegation arrived in Malaysia for meetings from August 4-7 to enhance ceasefire efforts."},
  {"date": "2025-08-02", "event": "Thai media reports Cambodian drones flying into Thai territory, which Cambodia rejects as false, accusing Thailand of misinformation."},
  {"date": "2025-08-01", "event": "Thailand returns two of 20 captured Cambodian soldiers, who Cambodia claims were tortured. Thailand asserts humane treatment."},
  {"date": "2025-07-30 17:45", "event": "172,094 Cambodians displaced: Siem Reap (61,907), Oddar Meanchey (39,546), Banteay Meanchey (35,057), Preah Vihear (32,558), Pursat (3,026)."},
  {"date": "2025-07-29", "event": "Thai forces capture 20 Cambodian soldiers near Oddar Meanchey, allegedly violating ceasefire. Cambodia denies Thai accusations."},
  {"date": "2025-07-29", "event": "Ceasefire signed to halt conflict, but Thai forces captured 20 unarmed Cambodian troops near Oddar Meanchey, displacing 39,546 more."},
  {"date": "2025-07-28 00:00", "event": "Ceasefire agreed in Malaysia, mediated by Anwar Ibrahim and Trump."},
  {"date": "2025-07-25", "event": "Fighting spreads to six areas; over 100,000 displaced across Cambodia and Thailand."},
  {"date": "2025-07-24 08:47", "event": "Cambodian forces retaliate in self-defense against Thai aggression."},
  {"date": "2025-07-24 08:46", "event": "Thai Second Army Region blocks access to Ta Moan Thom temple. Thai forces fire on Cambodian troops, extending to Ta Krabei, Phnom Kmoach, and Mom Bei, using jet fighters."},
  {"date": "2025-07-24 08:30", "event": "Thailand fires into the sky, escalating tensions."},
  {"date": "2025-07-24 07:04", "event": "Thailand hovers drone(s) for 2 minutes near Ta Moan Thom temple."},
  {"date": "2025-07-24 06:30", "event": "Thailand violates bilateral agreements by installing barbed wire at Ta Moan Thom temple."},
  {"date": "2025-07-24", "event": "Thai F-16 jets dropped MK-82 bombs near Preah Vihear Temple, escalating conflict and displacing over 32,558 people."},
  {"date": "2025-07-23", "event": "Second landmine explosion in disputed area. Thailand expels Cambodian ambassador and recalls their own."},
  {"date": "2025-07-16", "event": "Thai soldier steps on war-era landmine in disputed area, accuses Cambodia of laying new mines."},
  {"date": "2025-07-01", "event": "Thai PM suspended, demonstrating internal political instability."},
  {"date": "2025-06-22", "event": "Cambodia attempts peaceful negotiations, met with Thai refusal and non-cooperation."},
  {"date": "2025-06-19", "event": "Leaked phone call from Thai PM to Hun Sen sparks outrage; Thai politics destabilized. Cambodia halts Thai imports."},
  {"date": "2025-06-15", "event": "Cambodia submits ICJ application, seeking legal solution to border dispute."},
  {"date": "2025-05-28", "event": "Cambodian soldier killed during brief firefight in Preah Vihear."}
]