[
  {"date": "2025-05-28", "event": "Cambodian soldier killed during brief firefight in Preah Vihear."},
  {"date": "2025-06-15", "event": "Cambodia submits ICJ application, seeking legal solution to border dispute."},
  {"date": "2025-06-19", "event": "Leaked phone call from Thai PM to Hun Sen sparks outrage; Thai politics destabilized. Cambodia halts Thai imports in response to Thai threats and unilateral border closures."},
  {"date": "2025-06-22", "event": "Cambodia attempts peaceful negotiations, met with Thai refusal and non-cooperation."},
  {"date": "2025-07-01", "event": "Thai PM suspended, demonstrating internal political instability."},
  {"date": "2025-07-16", "event": "Thai soldier steps on war-era landmine in disputed area, accuses Cambodia of laying new mines."},
  {"date": "2025-07-23", "event": "Second landmine explosion in disputed area. Thailand expels Cambodian ambassador and recalls their own."},
  {"date": "2025-07-24 06:30", "event": "Thailand violates bilateral agreements by installing barbed wire at Ta Moan Thom temple."},
  {"date": "2025-07-24 07:04", "event": "Thailand hovers drone(s) for 2 minutes near Ta Moan Thom temple."},
  {"date": "2025-07-24 08:30", "event": "Thailand fires into the sky, escalating tensions."},
  {"date": "2025-07-24 08:46", "event": "Thai Second Army Region blocks access to Ta Moan Thom temple. Thai forces initiate fire on Cambodian troops at Ta Moan Thom, extending to Ta Krabei temple, Phnom Kmoach, and Mom Bei in Preah Vihear province, using jet fighters."},
  {"date": "2025-07-24 08:47", "event": "Cambodian forces retaliate in self-defense against Thai aggression."},
  {"date": "2025-07-25", "event": "Fighting spreads to six areas; over 100,000 displaced across Cambodia and Thailand."},
  {"date": "2025-07-28 00:00", "event": "Ceasefire agreed in Malaysia, mediated by Anwar Ibrahim and Trump."},
  {"date": "2025-07-30 17:45", "event": "172,094 Cambodians displaced: Siem Reap (61,907), Oddar Meanchey (39,546), Banteay Meanchey (35,057), Preah Vihear (32,558), Pursat (3,026)."},
  {"date": "2025-08-04", "event": "King Norodom Sihamoni authorizes Hun Sen to lead national defense coordination, granting full use of RCAF, including palace guards, akin to martial law, to protect Cambodia’s sovereignty."}
]
